<?php
/**
 * Created by PhpStorm.
 * User: zhangxian
 * Date: 16/7/12
 * Time: 下午3:33
 */
return [
    1001  => '验证码错误',
    1002  => '昵称最少2位字符',
    1003  => '密码错误',
    1004  => '用户不存在',
    1005  => '用户名已存在',
    1006  => '密码最少6位字符',
    1007  => '用户名不存在',
    1008  => '登录失败',
    1009  => '无变更',
    1010  => 'access_token无效',
    1011  => 'access_token过期',
    1012  => '未登录',
    1013  => '用户名为空',
    1014  => '密码为空',
    1015  => '用户删除失败',

    //图像处理
    1100  => '图片存储路径创建失败',
    1101  => '缩略图存储路径创建失败',
    1102  => '图片文件不存在',
    1103  => '图片删除失败',
    1104  => '文件非图片格式',
    1105  => '系统文件,禁止删除',
    1106  => '多文件中存在非图片文件',
    1107  => '回收目录创建失败',

    //文稿处理
    1200  => '标题不能为空',
    1201  => '标题不能长于50字符',
    1202  => '内容不能为空',
    1203  => '文章不存在',
    1204  => '文章删除失败',
    1205  => '文章创建失败',
    1206  => '文章分类名已存在',
    1207  => '文章分类id不存在',
    1208  => '文章分类名称为空',
    1209  => '文章更新失败',

    //商品
    1300  => '商品不存在',
    1301  => '商品名称不能为空',
    1302  => '商品名称最大50字符',
    1303  => '商品价格不能为空',
    1304  => '商品价格必须大于0',
    1305  => '商品库存不能为空',
    1306  => '商品库存必须大于0',
    1307  => '商品库存必须为整数',
    13071 => '商品新增失败',
    13072 => '商品更新失败',
    13073 => '商品删除失败',

    //ps
    13082 => '分类应用或模型不存在',
    13083 => '应用模型不存在',
    1308  => '分类名称不能为空',
    1309  => '分类fid不能小于0',
    1310  => '分类fid为整数',
    1311  => '分类名称已存在',
    1312  => 'fid不合法',
    1313  => '分类不存在',
    1314  => '此分类下存在数据',

    //设置
    1315  => '设置项不存在',
    1316  => '内容不存在',
    1317  => '内容类型不合法',

    //权限
    1318  => '无此操作权限',
    1319  => '无效角色',
    1320  => '无效用户',
    1321  => '无效权限',
    1322  => '权限为空',
    1323  => '角色添加权限失败',
    1324  => '用户添加角色失败',

    //common
    1400  => '目标文件不存在',
    1401  => '目标地址发生重定向',
    1402  => '目标地址需要验证',
    1403  => '目标地址无权访问',
    1404  => '目标服务器内部错误',
    1405  => '目标文件打开失败',
    1406  => '信息比对并无变更',

    //视频
    1500  => '视频路径创建失败',
    1501  => '视频创建失败',
    1502  => '视频删除失败',
    1503  => '视频文件不存在',
    1504  => '视频截图失败',
    1505  => '上传数据无视频文件',
    1506  => '上传视频文件无效大小',
    1507  => '上传视频文件无效格式',

    //发布库
    1600  => '源数据id不合法',
    1601  => '源数据类型不合法',
    1602  => '发布路径创建失败',
    1603  => '发布失败',
    1604  => '发布id不存在',
    1605  => '发布库更新失败',
    1606  => '发布库删除失败',

    //相册
    1700  => '相册不存在',
    1701  => '相册标题不合法',
    1702  => '相册创建失败',
    1703  => '相册更新失败',
    1704  => '相册删除失败',

    //日志&还原
    1800  => '此类型数据不可恢复',
    1801  => '操作类型不可恢复',
    1802  => '此数据当前已被删除',
    1803  => '日志记录不存在',
    1804  => '素材已过期,无法恢复',
    1805  => '恢复类型不合法',
    1806  => '恢复数据原id被占用',
    1807  => '应用信息不合法',

    //标签
    1900  => '标签不存在',
    1901  => '标签名称不合法',
    1902  => '标签名称已存在',
    1903  => '标签创建失败',
    1904  => '标签更新失败',
    1905  => '标签应用中,不可删除',
    1906  => '标签删除失败',
    1907  => '标签数更新失败',

    //nginx
    2000  => '应用目录不存在,创建失败',
    2001  => 'nginx配置目录不存在,创建失败',
    2002  => 'hosts文件不可写,需手动配置'
];