<?php
/**
 * Created by PhpStorm.
 * User: zhangxian
 * Date: 16/7/12
 * Time: 下午3:33
 */
return [
    1001 => '验证码信息错误',
    1002 => '昵称最少2位字符',
    1003 => '密码错误',
    1004 => '用户id不存在',
    1005 => '用户名已存在',
    1006 => '密码最少6位字符',
    1007 => '用户名不存在',
    1008 => '登录失败',


    //图像处理
    1100 => '图片存储路径创建失败',
    1101 => '缩略图存储路径创建失败',
    1102 => '图片文件不存在',
    1103 => '图片删除失败',
    1104 => '文件非图片格式',
    1105 => '系统文件,禁止删除',
    1106 => '多文件中存在非图片文件',

    //文稿处理
    1200 => '标题不能为空',
    1201 => '标题不能长于50字符',
    1202 => '内容不能为空',
    1203 => '文章不存在',
    1204 => '文章删除失败',
    1205 => '文章创建失败',
    1206 => '文章分类名已存在',
    1207 => '文章分类id不存在',
    1208 => '文章分类名称为空',

    //商品
    1300 => '商品不存在',
    1301 => '商品名称为空',
    1302 => '商品名称最大50字符',
    1303 => '商品价格为空',
    1304 => '商品价格大于0',
];